#include <stdio.h>
#include "programm.h"

int main() {
    system("clear");
    zast();
    while (1) {
        printf("----------------------------------------------------------------------------------------------\n\t\t\t\t\tМеню\n\t\t\t1 - Контрольный расчет для n точек;\n\t\t\t2 - Расчет параметра;\n\t\t\t3 - Запись данных в файл;\n\t\t\t4 - Открыть wxMaxima;\n----------------------------------------------------------------------------------------------\n>> ");
        fail:;
        char ch = 0;
        ch = getchar();
        if(ch != 10) start(ch);
        else goto fail;
    }
}
