#include <stdio.h>
#include <stdlib.h>
#include "lr06.h"

int main(){
    system("/bin/stty intr ^[");
    while(1) {
        int numOfMethod = -1, numOfInputMethod = -1;
        while(numOfMethod == -1){
            system("clear");
            printf("\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            +-------------------------------------=<[МЕНЮ]>=---------------------------------------+\n");
            printf("                            | 1) Найти минимальный элемент в каждой строке матрицы среди положительных элементов.  |\n");
            printf("                            | 2) Найти сумму номеров минимального и максимального элементов её побочной диагонали. |\n");
            printf("                            | 3) Упорядочить по возрастанию первый столбец матрицы.                                |\n");
            printf("                            | 4) Упорядочить по убыванию главную диагональ.                                        |\n");
            printf("                            +--------------------------------------------------------------------------------------+\n");
            printf("                                                    Выберите способ решения: ");
            numOfMethod = Checker();
        }
        while(numOfInputMethod == -1){
            system("clear");
            printf("\n\n\n\n\n\n\n\n\n\n\n\n\n\n                            +-------------------------------------=<[МЕНЮ]>=---------------------------------------+\n");
            printf("                            | 1) Из тела программы.                                                                |\n");
            printf("                            | 2) С экрана.                                                                         |\n");
            printf("                            | 3) Из файла.                                                                         |\n");
            printf("                            | 4) Случайные числа.                                                                  |\n");
            printf("                            +--------------------------------------------------------------------------------------+\n");
            printf("                                                    Выберите способ ввода: ");
            numOfInputMethod = Checker();
        }
        input(numOfMethod, numOfInputMethod);
    }
}